In [1]:
import pandas as pd

In [2]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [3]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [4]:
# Selecionando uma coluna

df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [6]:
# Mais de uma coluna

df[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [12]:
# Seleção por linha
## Todas as linhas

df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [13]:
## A partir da linha 1

df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [14]:
## Somente l2 e l3

df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [15]:
## Selecionando linhas e colunas

df[1:][['c3','c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [16]:
## Selecionando a partir dos rótulos com loc

df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [17]:
## Selecionando mais de uma linha a partir dos rótulos com loc

df.loc[['l3', 'l1']]

    c1  c2  c3  c4
l3   8  10  11  12
l1   1   2   3   4

In [19]:
## Selecionando valores (batalha naval)

df.loc['l1','c2']

2

In [21]:
## Selecionando a partir do index iloc

df.iloc[0,1]

2

In [24]:
## Selecionando grupos de linhas e colunas

df.loc[['l3','l1'],['c4','c1']]

    c4  c1
l3  12   8
l1   4   1

In [25]:
## Selecionando grupos de linhas e colunas

df.iloc[[2,0],[3,0]]

    c4  c1
l3  12   8
l1   4   1

In [26]:
# Crie um DataFrame somente com os alunos reprovados e mantenha neste DataFrame 
# apenas as colunas Nome, Sexo e Idade, nesta ordem.

alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [28]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [30]:
selecao = alunos['Aprovado'] == False
reprovados = alunos.loc[selecao, ['Nome', 'Sexo', 'Idade']]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35